OSMICardsTo1Ci/src/Catalogs/ОСМИ_НастройкаСобытий/ОСМИ_НастройкаСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_НастройкаСобытий</name>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеОсновногоОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаДляПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ОСМИ_Действие</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРассылки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OSMICardsTo1Ci/src/Enums/ОСМИ_Действие/ОСМИ_Действие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОСМИ_Действие</name>
  <enumValues>
    <name>ОтправитьДанныеКартыНаСервер</name>
  </enumValues>
  <enumValues>
    <name>ПушРассылка</name>
  </enumValues>
  <enumValues>
    <name>МаркетинговаяАкция</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаАнкетныхДанных</name>
  </enumValues>
</mdclass:Enum>

OSMICardsTo1Ci/src/Documents/ОСМИ_ДинамическаяАкция/ОСМИ_ДинамическаяАкция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОСМИ_ДинамическаяАкция</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстАкции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>CatalogRef.ОСМИ_Картинки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПолучателей</name>
    <type>
      <types>CatalogRef.ОСМИ_ГруппыПолучателей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Карта</name>
      <type>
        <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

OSMICardsTo1Ci/src/Catalogs/ОСМИ_НастройкаСобытий/ObjectModule.bsl
Функция ПолучитьСписокКарт(ИсточникДанных) Экспорт
	Источник = ИсточникДанных;
	Попытка
		Результат = новый Массив;
		Выполнить(ТекстПрограммы);
		Возврат(Результат);
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Возврат Новый Массив;
	КонецПопытки;
КонецФункции

Функция ОтработатьСобытие(ИсточникСобытия) Экспорт
	
	Попытка
		
		СписокКарт = ПолучитьСписокКарт(ИсточникСобытия);
		
		Если Действие = Перечисления.ОСМИ_Действие.ОтправитьДанныеКартыНаСервер Тогда
			Для Каждого Карта из СписокКарт Цикл
				Карта = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Карта);
				Если не Карта = Неопределено Тогда
					КартаОбъект = Карта.ПолучитьОбъект();
					КартаОбъект.УстановитьЗначенияПолей();
					КартаОбъект.ОбновитьЗначенияССервера();
					КартаОбъект.ОбменДанными.Загрузка = Истина;
					КартаОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.ПушРассылка Тогда
			ПушРассылка = Документы.ОСМИ_ПушРассылка.СоздатьДокумент();
			Для Каждого Карта из СписокКарт Цикл
				Стр = ПушРассылка.Адресаты.Добавить();
				Стр.Карта = Карта;
			КонецЦикла;
			Если ПушРассылка.Адресаты.Количество() > 0 Тогда 
				ПушРассылка.Дата = ТекущаяДата();
				ПушРассылка.ТекстСообщения = ТекстРассылки;
				ПушРассылка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.МаркетинговаяАкция Тогда
			МаркетинговаяАкция =  Документы.ОСМИ_ДинамическаяАкция.СоздатьДокумент();
			Для Каждого Карта из СписокКарт Цикл
				Стр = МаркетинговаяАкция.Адресаты.Добавить();
				Стр.Карта = Карта;
			КонецЦикла;
			Если ПушРассылка.Адресаты.Количество() > 0 Тогда 
				МаркетинговаяАкция.Дата = ТекущаяДата();
				МаркетинговаяАкция.ТекстСообщения = ТекстРассылки;
				МаркетинговаяАкция.ТекстАкции = ТекстПоля;
				МаркетинговаяАкция.ТекстЗаголовка = ТекстЗаголовка;
				МаркетинговаяАкция.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка",УровеньЖурналаРегистрации.Ошибка,,ссылка,
		ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции
